In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [5]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
(psycopg2.ProgrammingError) function sum() does not exist
LINE 1: SELECT SUM() FROM songplays LIMIT 5;
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
 [SQL: 'SELECT SUM() FROM songplays LIMIT 5;']

In [11]:
%sql SELECT gender, count(*) FROM users GROUP BY gender;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('M', 1933), ('F', 4887)]

In [9]:
%sql SELECT * FROM USERS LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(91, 'Jayden', 'Bell', 'M', 'free'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (73, 'Jacob', 'Klein', 'M', 'paid')]

In [3]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [4]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

NameError: name 'conn' is not defined